{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_weight", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_bias", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc", 
      "attrs": {"num_hidden": "2"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "svm_label", 
      "inputs": []
    }, 
    {
      "op": "SVMOutput", 
      "name": "svm", 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 4], 
  "node_row_ptr": [0, 1, 2, 3, 4, 5, 6], 
  "heads": [[5, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10100]}
}